/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package meu.config;

import java.util.Arrays;
import java.util.List;

/**
 *
 * @author thristov
 */
public class Config {

    public static List<String> NAME_SUFFIXES = Arrays.asList("ова", "ева", "ска", "ов", "ев", "ски", "ин", "он",
            "ина", "ич", "ян", "ан", "ен", "ена", "чки", "чка", "цки", "цка", "шки", "шка", "зки", "зка", "яна", "ана",
            "иан", "ай", "тър", "нас", "ава", "мир", "мира", "слав", "слава", "рия", "лка", "дор", "дорка", "ола",
            "рги", "ика", "ей", "вко", "вкa", "ади", "ора", "ндра", "нчо", "вчо", "ени", "ения", "етла", "ита", "нко",
            "ица", "гор", "лко", "нка", "лия", "дко", "сим", "лин", "сто", "йно", "йна", "лчо", "оил", "рис", "ндър",
            "вел", "аил", "аила", "ела", "йка"
    );

    public static List<String> OTHER_PERSONAL_NAMES = Arrays.asList("ахмед", "ахмет", "мехмед", "сезгин", "мюмюн", "мустафа",
            "халил", "гюнер", "гюнай", "сунай", "байрам", "ибрям", "хасан", "джейхан", "ерджан", "рамадан", "фатме", "редже", "хамид",
            "хамди", "юсеин", "хусейн", "сабри", "али", "адам", "анави", "аврам", "арон", "финци", "шварц", "леви", "ицхак", "исак",
            "коен", "соломон", "яков", "щайн", "берг", "джераси", "езра", "фридман", "йосиф", "барух", "давид", "бехар", "илиева",
            "дурмуш", "петко", "янко", "слав", "антонио", "явор", "шипоч", "минка", "нели", "юлия", "лало", "кунка", "паца", "илия",
            "анна", "рашо", "ася", "гого", "пена", "янка", "нина", "иван", "гошо"
    );

    public static List<String> NON_PERSONAL_INDICATORS = Arrays.asList("мбал", "ет", "медицински", "прогрес", "мг", "дпуб", "еоо", "еппд",
            "оод", "сд", "камара", "аптека", "агенция", "ад", "зад", "еад", "еод", "еоод", "дззд", "зк", "съд", "тд", "ел", "сж", "гр", "цкб",
            "асоциация", "фондация", "зпк", "сие", "холдинг", "български", "българска", "българско", "българия", "сдо", "град", "бтк", "пиб",
            "дск", "европейски", "европейска", "европейско", "руски", "руска", "руско", "турски", "турска", "турско", "фонд", "тур", "турс",
            "сръбски", "сръбска", "сръбско", "македонски", "македонска", "македонско", "студентски", "студентска", "студентско", "ту", "иа",
            "румънски", "румънска", "румънско", "германски", "германска", "германско", "италиански", "италианска", "италианско", "цд", "мо",
            "арменски", "арменска", "арменски", "католически", "католическа", "католическо", "протестантски", "протестантска", "протестантско",
            "мюсюлмански", "мюсюлманска", "мюсюлманско", "английски", "английска", "английско", "британски", "британска", "британско",
            "испански", "испанска", "испанско", "френски", "френска", "френско", "норвежки", "норвежка", "норвежко", "ммг", "нап", "бдск",
            "бритиш", "клуб", "съвет", "общност", "вту", "тп", "тб", "дсп", "тпг", "и", "стз", "къща", "театър", "кооперация", "нси", "пс",
            "институт", "музей", "дружество", "нуфи", "соу", "оу", "пг", "пгее", "ипсмп", "апимп", "апмп", "аиппдм", "груп", "пги",
            "дирекция", "верига", "стопанска", "гимназия", "гпче", "гпие", "станция", "читалище", "пгехт", "пго", "пгтс", "пгим",
            "пгто", "пгпт", "пгс", "пгпо", "нгдек", "нгпи", "пгтхт", "пгдва", "спге", "сгсаг", "пгметт", "пгххт", "пгхтд", "пгмт",
            "цнпх", "пгте", "пглв", "пгох", "ипазр", "патг", "пмг", "обединение", "ипжз", "филиал", "клон", "тпки", "комплекс",
            "продукт", "палата", "министерство", "ауто", "база", "секюрити", "библиотека", "област", "народна", "сдружение", "ав",
            "община", "общински", "общинска", "общинско", "сбдпл", "аиппмп", "лаборатория", "градина", "училище", "ппок", "амцсп",
            "филм", "център", "ввму", "нву", "биогаз", "амбулатория", "амбулаторна", "агро", "университет", "университетски",
            "университетска", "университетско", "мбпл", "обединени", "обединена", "обединено", "комерс", "артс", "компания",
            "прокуратура", "чси", "комисия", "адвокат", "адвокатски", "адвокатска", "адвокатско", "хотел", "хотелска", "хотелски",
            "оусв", "манастир", "консорциум", "ентърпрайс", "импорт", "експорт", "импекс", "стил", "вик", "цм", "шел",
            "селскостопански", "селскостопанска", "селскостопанско", "селскостопанство", "инженер", "мост", "депозитар",
            "нотариус", "петол", "изба", "сбал", "аппмп", "асмп", "дмсгд", "дент", "енерджи", "airline", "експрес", "ресторант",
            "зпад", "пад", "академия", "вода", "телевизия", "софийски", "софийска", "софийско", "стокова", "бан", "банк", "банка",
            "пропан", "бутан", "ерр", "урожай", "основа", "под", "подел", "поделение", "фсд", "дфсд", "дсфмо", "нвми", "митница", "аерогара",
            "мбдплр", "СТОЛИЧНО", "терем", "травел", "разпределение", "електроразпределение", "мобилтел", "офис", "съюз", "топлофикация",
            "петрол", "превози", "трейдинг", "военна", "сигурност", "сикюрити", "глобъл", "военно", "финанси", "захран", "захранване",
            "договор", "филтър", "параграф", "есен", "обезщ", "трудова", "труд", "машина", "жилищен", "модул", "воен", "общ", "храна",
            "дело", "обезщет", "пар", "охрана", "абон", "авторски", "каса", "електронен", "материали", "ремонт", "техника", "дискове",
            "данък", "сгради", "билети", "компютър", "вноска", "придобиване", "съоръжения", "вал", "валута", "природен", "инвен",
            "обществена", "поръчка", "смяна", "моторен", "финансов", "контрол", "касова", "наличност", "стикер", "бензин", "газьол",
            "промишлен", "продукти", "стола", "сума", "аварийна", "картон", "задължения", "диагностика", "каски", "настилка",
            "сандвич", "пица", "луканка", "наденица", "САНДВИЧ", "изделия", "анализ", "тестени", "година", "телефон", "полицай",
            "канцеларски", "граница", "топограф", "глава", "камера", "мрежова", "защита", "палка", "полигон", "подмяна", "спрей",
            "опит", "закупени", "нощувки", "пансион", "ру", "мдт", "район", "градска", "художествена", "су", "детска", "ясла",
            "дг", "пгии", "ч-ще", "нч", "обучение", "обу", "воденица", "закуски", "дадени", "дисплей", "системен", "оператор",
            "машиностроителен", "гумени", "подложки", "капиталов", "трансвер", "възстановен", "гаранционен", "депозит", "помещения",
            "връзки", "дренаж", "интерактивен", "екран", "кооп", "инвалиди", "безвъзмезден", "начин", "граждански", "договори",
            "прехвърлени", "средства", "извършен", "правен", "мсе", "крайно", "пластина", "пружина", "тягова", "батерия",
            "промишлена", "енергетика", "уб", "кд", "бту", "битова", "електроника", "бряг", "стоки", "буллифт", "пощи", "обшина",
            "областна", "адв", "адв.", "хигиенно", "медицинска", "индустрия", "издателство", "бюлетин", "дкси"
    );

}
